/**
 * @author El Baron 09.07.2024
 * \t  — Символ табуляции (в java – эквивалент четырех пробелов);
 * \b — Символ возврата в тексте на один шаг назад или удаление одного символа в строке (backspace);
 * \n — Символ перехода на новую строку;
 * \r — Символ возврата каретки;
 * \f— Прогон страницы к началу следующей страницы;
 * \' — Символ одинарной кавычки;
 * \" — Символ двойной кавычки;
 * \\ — Символ обратной косой черты (\).
 */
public class Main {
    public static void main(String[] args) {
        System.out.print("*****************************\n");
        System.out.print("****\tВизитка\t\t\t ****\t\n");
        System.out.print("**** Name: \"Дима\"\t\t ****\n");
        System.out.print("**** Skype: paladinre413 ****\n");
        System.out.print("*****************************\n");
    }
}
